# Data merge

In [9]:
import pandas as pd

# Example datasets for data merging
data1 = {
    'id': [1, 2, 3],
    'name': ['Alex', 'Amy', 'Allen'],
    'age': [28, 32, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   id   name  age
0   1   Alex   28
1   2    Amy   32
2   3  Allen   24

In [10]:
# Dataset 2: Additional Information
data2 = {
    'id': [1, 2, 3],
    'city': ['California', 'New York', 'London'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id        city occupation
0   1  California   Engineer
1   2    New York     Doctor
2   3      London    Teacher

In [11]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df.head()

   id   name  age        city occupation
0   1   Alex   28  California   Engineer
1   2    Amy   32    New York     Doctor
2   3  Allen   24      London    Teacher

---
# Concatenation

In [12]:
import pandas as pd

# Example datasets for Pakistani context
# Dataset 1 - Pakistani Names and Ages
data1 = {'Name': ['Ally', 'Ben', 'Alex'], 'Age': [28, 32, 24]}
# Dataset 2 - More Pakistani Names and Ages
data2 = {'Name': ['Sarah', 'Gary', 'Ola'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and Provinces in Pakistan
data3 = {'City': ['New york', 'California', 'London'], 'Province': ['Los Angeles', 'San Francisco', 'Manchester']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# Concatenating Rows
concatenated_rows = pd.concat([df1, df2])

# Concatenating Columns
# Note: For a meaningful column-wise concatenation, dataframes should have the same number of rows.
concatenated_columns = pd.concat([df1, df3], axis=1)
print(concatenated_rows)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
concatenated_columns

    Name  Age
0   Ally   28
1    Ben   32
2   Alex   24
0  Sarah   29
1   Gary   35
2    Ola   27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

   Name  Age        City       Province
0  Ally   28    New york    Los Angeles
1   Ben   32  California  San Francisco
2  Alex   24      London     Manchester